Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 32, 32, 32)        896       
                                                                 
 max_pooling2d (MaxPooling2D  (None, 16, 16, 32)       0         
 )                                                               
                                                                 
 flatten (Flatten)           (None, 8192)              0         
                                                                 
 dense (Dense)               (None, 10)                81930     
                                                                 
=================================================================
Total params: 82,826
Trainable params: 82,826
Non-trainable params: 0
_________________________________________________________________
None

EPOCHS: 30

Loss after epoch:
10:     loss: 0.9210 - accuracy: 0.6867 - val_loss: 1.0711 - val_accuracy: 0.6311
20:     loss: 0.7733 - accuracy: 0.7370 - val_loss: 1.0260 - val_accuracy: 0.6571
30:     loss: 0.6696 - accuracy: 0.7708 - val_loss: 1.0999 - val_accuracy: 0.6345