Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 32, 32, 128)       3584      
                                                                 
 max_pooling2d (MaxPooling2D  (None, 16, 16, 128)      0         
 )                                                               
                                                                 
 batch_normalization (BatchN  (None, 16, 16, 128)      512       
 ormalization)                                                   
                                                                 
 conv2d_1 (Conv2D)           (None, 16, 16, 64)        204864    
                                                                 
 max_pooling2d_1 (MaxPooling  (None, 8, 8, 64)         0         
 2D)                                                             
                                                                 
 batch_normalization_1 (Batc  (None, 8, 8, 64)         256       
 hNormalization)                                                 
                                                                 
 conv2d_2 (Conv2D)           (None, 8, 8, 32)          100384    
                                                                 
 max_pooling2d_2 (MaxPooling  (None, 4, 4, 32)         0         
 2D)                                                             
                                                                 
 batch_normalization_2 (Batc  (None, 4, 4, 32)         128       
 hNormalization)                                                 
                                                                 
 flatten (Flatten)           (None, 512)               0         
                                                                 
 dense (Dense)               (None, 10)                5130      
                                                                 
=================================================================
Total params: 314,858
Trainable params: 314,410
Non-trainable params: 448
_________________________________________________________________
None

EPOCHS: 30

Loss after epoch:
10:     loss: 0.1681 - accuracy: 0.9440 - val_loss: 1.2171 - val_accuracy: 0.6978
20:     loss: 0.0501 - accuracy: 0.9833 - val_loss: 1.5697 - val_accuracy: 0.7287
30:     loss: 0.0282 - accuracy: 0.9904 - val_loss: 1.9753 - val_accuracy: 0.6902